"For the week ending 2018-03-22...There were 57... new artists making their debut on the chart At position 185...  we have 5 Seconds of Summer... who is debuting with the song Want You Back with 2119 streams ...  At position 187...  we have A$AP Ferg... who is debuting with the song Plain Jane with 2112 streams ...  At position 177...  we have AC/DC... who is debuting with the song Back In Black with 2177 streams ...  At position 174...  we have AJR... who is debuting with the song Sober Up (feat. Rivers Cuomo) with 2179 streams ...  At position 195...  we have AKA... who is debuting with the song StarSigns with 2066 streams ...  At position 92...  we have Alan Walker... who is debuting with the song All Falls Down (feat. Juliander) with 3150 streams ...  At position 106...  we have Axwell /\\ Ingrosso... who is debuting with the song More Than You Know with 2807 streams ...  At position 160...  we have Beyonc... who is debuting with the song Halo with 2278 streams ...  At position 91...  we have Big Shaq... who is debuting with the song Man's Not Hot with 3208 streams ...  At position 194...  we have Black Motion... who is debuting with the song Imali with 2071 streams ...  At position 152...  we have Calum Scott... who is debuting with the song You Are The Reason with 2362 streams ...  At position 192...  we have CamelPhat... who is debuting with the song Cola with 2090 streams ...  At position 140...  we have Cardi B... who is debuting with the song Bartier Cardi (feat. 21 Savage) with 2502 streams ...  At position 163...  we have Charlie Puth... who is debuting with the song Done for Me (feat. Kehlani) with 2268 streams ...  At position 190...  we have Childish Gambino... who is debuting with the song Redbone with 2099 streams ...  At position 151...  we have DMX... who is debuting with the song X Gon' Give It To Ya with 2362 streams ...  At position 155...  we have Daniel Caesar... who is debuting with the song Best Part (feat. H.E.R.) with 2334 streams ...  At position 88...  we have Demi Lovato... who is debuting with the song Sorry Not Sorry with 3269 streams ...  At position 61...  we have Dennis Lloyd... who is debuting with the song Nevermind with 4350 streams ...  At position 120...  we have Desiigner... who is debuting with the song Panda with 2681 streams ...  At position 156...  we have Distruction Boyz... who is debuting with the song Omunye with 2331 streams ...  At position 178...  we have Earth... who is debuting with the song September with 2158 streams ...  At position 184...  we have Eurythmics... who is debuting with the song Sweet Dreams (Are Made of This) - Remastered with 2122 streams ...  At position 79...  we have Famous Dex... who is debuting with the song PICK IT UP (feat. A$AP Rocky) with 3447 streams ...  At position 141...  we have French Montana... who is debuting with the song Unforgettable with 2495 streams ...  At position 133...  we have J. Cole... who is debuting with the song No Role Modelz with 2590 streams ...  At position 154...  we have James Arthur... who is debuting with the song Say You Won't Let Go with 2339 streams ...  At position 165...  we have Jason Isbell and the 400 Unit... who is debuting with the song If We Were Vampires with 2236 streams ...  At position 168...  we have Jason Mraz... who is debuting with the song I'm Yours with 2221 streams ...  At position 128...  we have Journey... who is debuting with the song Don't Stop Believin' with 2622 streams ...  At position 73...  we have King Princess... who is debuting with the song 1950 with 3732 streams ...  At position 40...  we have Kygo... who is debuting with the song Remind Me to Forget with 5271 streams ...  At position 95...  we have Lauv... who is debuting with the song I Like Me Better with 3097 streams ...  At position 33...  we have Lil Dicky... who is debuting with the song Freaky Friday (feat. Chris Brown) with 6013 streams ...  At position 157...  we have Lil Skies... who is debuting with the song Nowadays (feat. Landon Cube) with 2328 streams ...  At position 138...  we have Lord Huron... who is debuting with the song The Night We Met with 2528 streams ...  At position 139...  we have Maggie Lindemann... who is debuting with the song Pretty Girl - Cheat Codes X CADE Remix with 2519 streams ...  At position 127...  we have Major Lazer... who is debuting with the song Particula (feat. DJ Maphorisa, Nasty C, Ice Prince, Patoranking & Jidenna) with 2626 streams ...  At position 134...  we have Michael Jackson... who is debuting with the song Billie Jean with 2570 streams ...  At position 114...  we have Miguel... who is debuting with the song Sky Walker (feat. Travis Scott) with 2730 streams ...  At position 126...  we have Nicky Jam... who is debuting with the song X with 2641 streams ...  At position 196...  we have Papa Roach... who is debuting with the song Last Resort with 2060 streams ...  At position 188...  we have Pascal & Pearce... who is debuting with the song Running Wild with 2106 streams ...  At position 170...  we have Queen... who is debuting with the song Another One Bites The Dust - Remastered 2011 with 2213 streams ...  At position 173...  we have R. Kelly... who is debuting with the song Ignition - Remix with 2180 streams ...  At position 60...  we have Rae Sremmurd... who is debuting with the song Powerglide (feat. Juicy J) - From SR3MM with 4403 streams ...  At position 158...  we have Rag'n'Bone Man... who is debuting with the song Human with 2316 streams ...  At position 169...  we have Rihanna... who is debuting with the song FourFiveSeconds with 2218 streams ...  At position 144...  we have Sabrina Carpenter... who is debuting with the song Alien with 2440 streams ...  At position 150...  we have Shawn Mendes... who is debuting with the song There's Nothing Holdin' Me Back with 2372 streams ...  At position 189...  we have Smokepurpp... who is debuting with the song 123 with 2103 streams ...  At position 167...  we have Starley... who is debuting with the song Call on Me (Ryan Riback Remix) with 2226 streams ...  At position 107...  we have TOTO... who is debuting with the song Africa with 2802 streams ...  At position 51...  we have Taylor Swift... who is debuting with the song Delicate with 4677 streams ...  At position 176...  we have The Police... who is debuting with the song Every Breath You Take with 2177 streams ...  At position 97...  we have Travis Scott... who is debuting with the song goosebumps with 3008 streams ...  At position 110...  we have ZAYN... who is debuting with the song Dusk Till Dawn (feat. Sia) - Radio Edit with 2800 streams ... All in all, the new artists generated a total of 153201... streams in their debut week"