"For the week ending 2018-12-27...There were 34... new artists making their debut on the chart At position 70...  we have Bing Crosby... who is debuting with the song White Christmas with 12568 streams ...  At position 44...  we have Brett Eldredge... who is debuting with the song Baby, It's Cold Outside (feat. Meghan Trainor) with 15330 streams ...  At position 103...  we have Britney Spears... who is debuting with the song My Only Wish (This Year) with 10042 streams ...  At position 109...  we have Bruce Springsteen... who is debuting with the song Santa Claus Is Comin' to Town - Live at C.W. Post College, Greenvale, NY - December 1975 with 9776 streams ...  At position 75...  we have Burl Ives... who is debuting with the song A Holly Jolly Christmas - Single Version with 12034 streams ...  At position 76...  we have Chris Rea... who is debuting with the song Driving Home for Christmas with 12022 streams ...  At position 189...  we have Christina Aguilera... who is debuting with the song Have Yourself a Merry Little Christmas with 6630 streams ...  At position 177...  we have Chuck Berry... who is debuting with the song Run Rudolph Run - Single Version with 7005 streams ...  At position 118...  we have Coldplay... who is debuting with the song Christmas Lights with 9266 streams ...  At position 180...  we have Darlene Love... who is debuting with the song Christmas (Baby Please Come Home) with 6954 streams ...  At position 35...  we have Dean Martin... who is debuting with the song Let It Snow! Let It Snow! Let It Snow! with 16280 streams ...  At position 194...  we have Ella Fitzgerald... who is debuting with the song Sleigh Ride with 6497 streams ...  At position 154...  we have Elton John... who is debuting with the song Step Into Christmas with 7798 streams ...  At position 174...  we have Elvis Presley... who is debuting with the song Blue Christmas with 7062 streams ...  At position 59...  we have Frank Sinatra... who is debuting with the song Let It Snow! Let It Snow! Let It Snow! (with The B. Swanson Quartet) with 13702 streams ...  At position 149...  we have Gwen Stefani... who is debuting with the song You Make It Feel Like Christmas (feat. Blake Shelton) with 7950 streams ...  At position 41...  we have John Lennon... who is debuting with the song Happy Xmas (War Is Over) - Remastered 2010 with 15591 streams ...  At position 86...  we have Jos Feliciano... who is debuting with the song Feliz Navidad with 11185 streams ...  At position 171...  we have Kabza De Small... who is debuting with the song Umshove with 7192 streams ...  At position 36...  we have Kelly Clarkson... who is debuting with the song Underneath the Tree with 16269 streams ...  At position 108...  we have Kylie Minogue... who is debuting with the song Santa Baby with 9780 streams ...  At position 162...  we have Leona Lewis... who is debuting with the song One More Sleep with 7615 streams ...  At position 173...  we have Master KG... who is debuting with the song Skeleton Move with 7113 streams ...  At position 141...  we have Meghan Trainor... who is debuting with the song I'll Be Home with 8411 streams ...  At position 72...  we have Nat King Cole... who is debuting with the song The Christmas Song (Merry Christmas To You) with 12463 streams ...  At position 30...  we have Paul McCartney... who is debuting with the song Wonderful Christmastime - Edited Version / Remastered 2011 with 17257 streams ...  At position 89...  we have Perry Como... who is debuting with the song It's Beginning to Look a Lot Like Christmas (with Mitchell Ayres & His Orchestra) with 10577 streams ...  At position 153...  we have Shado M... who is debuting with the song Inhliziyo Yami Ithi Hey with 7800 streams ...  At position 123...  we have Shakin' Stevens... who is debuting with the song Merry Christmas Everyone with 9046 streams ...  At position 134...  we have Stevie Wonder... who is debuting with the song What Christmas Means To Me with 8677 streams ...  At position 127...  we have The Jackson 5... who is debuting with the song Santa Claus Is Coming To Town with 8897 streams ...  At position 187...  we have The Pogues... who is debuting with the song Fairytale of New York (feat. Kirsty MacColl) with 6651 streams ...  At position 48...  we have The Ronettes... who is debuting with the song Sleigh Ride with 14863 streams ...  At position 79...  we have Tony Bennett... who is debuting with the song Winter Wonderland with 11570 streams ... All in all, the new artists generated a total of 351873... streams in their debut week"